{
  "backend/main.mo": "Motoko backend implementing access control, user profiles, article CRUD with admin permissions, and admission request handling.",
  "feature_evidence.json": "Feature evidence listing contact page updates and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all major frontend files for quick reference.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata, icons, manifest link, and loading the main React script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, and startup configuration.",
  "frontend/src/App.tsx": "Main React router setup defining public and admin routes with layout and profile modal integration.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper component that restricts access to admin routes based on authentication and admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to submit their name and email.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall page layout with header, navigation, content area, and footer for the site.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Implements responsive primary navigation with admin-aware links and mobile sheet menu.",
  "frontend/src/hooks/admin/useAdminArticleMutations.ts": "Provides React Query hooks for CRUD operations and publish toggling for admin-managed articles.",
  "frontend/src/hooks/admin/useAdminStatus.ts": "Checks whether the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/admissions/useAdmissionRequests.ts": "Fetches all admission requests and provides a mutation to delete individual requests.",
  "frontend/src/hooks/admissions/useSubmitAdmission.ts": "Provides a mutation to submit a new admission request to the backend.",
  "frontend/src/hooks/articles/useArticleById.ts": "Fetches a single article by its ID using the backend actor.",
  "frontend/src/hooks/articles/usePublishedArticles.ts": "Fetches all published articles from the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity state and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity restoration via a React context.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks to get and update the caller's user profile using React Query and the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/Admin/AdminAdmissionsPage.tsx": "Displays and manages admission requests, including loading state, listing entries, and archiving them via a confirmation dialog.",
  "frontend/src/pages/Admin/AdminArticlesPage.tsx": "Provides full CRUD and publish/unpublish controls for articles with dialogs for create and edit operations.",
  "frontend/src/pages/Admin/AdminDashboardPage.tsx": "Shows admin navigation cards linking to article management and admission request pages.",
  "frontend/src/pages/Admissions/AdmissionsPage.tsx": "Renders a student admission form, handles submission, and shows a confirmation screen after success.",
  "frontend/src/pages/Articles/ArticleDetailPage.tsx": "Fetches and displays a single published article with loading and error states.",
  "frontend/src/pages/Articles/ArticlesListPage.tsx": "Lists all published articles with loading and error handling and links to detail pages.",
  "frontend/src/pages/Contact/ContactPage.tsx": "Renders a contact page with WhatsApp, phone, email, address, and social links plus clipboard copy actions and toast feedback.",
  "frontend/src/pages/Home/HomePage.tsx": "Implements the homepage with a hero banner, feature cards, and navigation buttons for admissions and articles.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters using query strings, hash fragments, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, fonts, container behavior, animations, and plugins.",
  "project_state.json": "Defines the project’s state, features, requirements, and high-level goals for the Keep Going Classes web/app build."
}