{
  "backend/main.mo": "Motoko canister implementing user profiles, article CRUD with admin permissions, and admissions management using access control.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose of various frontend components, pages, hooks, and configuration files.",
  "frontend/CUSTOM_DOMAIN_SETUP.md": "Guide explaining how to configure DNS and register a custom domain for the app on the Internet Computer.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color variables and global UI defaults.",
  "frontend/index.html": "App entry HTML including manifest, icons, metadata, and root script references for the frontend build.",
  "frontend/public/.well-known/ii-alternative-origins": "Internet Identity configuration listing approved alternative origins for authentication.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining metadata, icons, theme colors, and start URL.",
  "frontend/src/App.tsx": "Sets up TanStack Router with basepath support and defines public and admin routes wrapped in layout and profile modal.",
  "frontend/src/components/auth/AdminGuard.tsx": "Auth guard that requires login and admin status before rendering protected admin routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal for new authenticated users to set name and email and saves the profile.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, content area, and footer.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Renders desktop and mobile navigation with dynamic admin links and a login button.",
  "frontend/src/config/youtube.ts": "Stores YouTube channel configuration and a helper to build the feed URL.",
  "frontend/src/hooks/admin/useAdminArticleMutations.ts": "Provides queries and mutations for admin article CRUD and publishing with cache invalidation.",
  "frontend/src/hooks/admin/useAdminStatus.ts": "Checks if the current authenticated user is an admin via actor interaction.",
  "frontend/src/hooks/admissions/useAdmissionRequests.ts": "Fetches all admission requests and provides a deletion mutation with cache updates.",
  "frontend/src/hooks/admissions/useSubmitAdmission.ts": "Submits a new admission request through the actor mutation.",
  "frontend/src/hooks/articles/useArticleById.ts": "Fetches a single article by ID using the backend actor.",
  "frontend/src/hooks/articles/usePublishedArticles.ts": "Loads all published articles via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching and saving the caller's user profile using React Query and an actor instance.",
  "frontend/src/hooks/youtube/useYouTubeChannelFeed.ts": "Fetches and parses a YouTube channel's XML feed into video objects and exposes it via a React Query hook.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and renders the root component.",
  "frontend/src/pages/Admin/AdminAdmissionsPage.tsx": "Displays and manages admission requests, allowing admins to view and archive them.",
  "frontend/src/pages/Admin/AdminArticlesPage.tsx": "Admin interface for creating, editing, publishing, and deleting articles.",
  "frontend/src/pages/Admin/AdminDashboardPage.tsx": "Admin landing page linking to article management and admission request tools.",
  "frontend/src/pages/Admissions/AdmissionsPage.tsx": "Renders an admission application form and handles submission with validation and success state.",
  "frontend/src/pages/Articles/ArticleDetailPage.tsx": "Loads and displays a single article by ID with loading and error states.",
  "frontend/src/pages/Articles/ArticlesListPage.tsx": "Displays published articles with loading, error, and empty states, and navigates to individual article pages.",
  "frontend/src/pages/Contact/ContactPage.tsx": "Shows contact details with copy-to-clipboard actions and links to social profiles.",
  "frontend/src/pages/CoursesExams/CoursesExamsPage.tsx": "Lists academic classes and competitive exam courses with descriptions and subjects.",
  "frontend/src/pages/Home/HomePage.tsx": "Renders the homepage with hero content, navigation buttons, and feature cards linking to articles and admissions.",
  "frontend/src/pages/YouTube/YouTubePage.tsx": "Fetches and displays YouTube videos with loading and error fallback states and links to the channel.",
  "frontend/src/utils/assetPaths.ts": "Utility that prepends the app's base URL to asset paths to ensure correct static file loading.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s state, features, issues, and architectural notes for the Keep Going Classes website and app."
}