{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, public article retrieval, and admin-only CRUD for articles and admission requests.",
  "feature_evidence.json": "JSON report mapping features to affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of various frontend files and components.",
  "frontend/CUSTOM_DOMAIN_SETUP.md": "Guide explaining how to configure DNS and register a custom domain for the app on the Internet Computer.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, themes, and layout defaults.",
  "frontend/index.html": "Base HTML template loading the app, manifest, icons, and main script using relative paths.",
  "frontend/public/.well-known/ii-alternative-origins": "Internet Identity configuration file declaring permitted alternative authentication origins.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and standalone display settings.",
  "frontend/RELEASE_V7_PROMOTION.md": "Checklist outlining build, configuration, and verification steps required to promote Version 7 to production.",
  "frontend/SMOKE_TEST_V7.md": "Detailed smoke test plan for validating Version 7 in production across public pages, admissions, authentication, and admin access.",
  "frontend/src/App.tsx": "Configures the app's routing structure, theme provider, and toaster, defining public and admin-protected routes with a shared layout.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin routes by checking authentication and admin status, showing loading, login, or access-denied states as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for login state and clearing cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal prompting authenticated users without a profile to enter basic details and save them via a mutation.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the site's header, navigation, main content area, and footer with branding and links.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Renders primary navigation with responsive desktop/mobile layouts, login button, and conditional admin link.",
  "frontend/src/config/youtube.ts": "Provides centralized YouTube channel configuration and a helper to generate the feed URL.",
  "frontend/src/hooks/admin/useAdminArticleMutations.ts": "Implements React Query hooks for CRUD operations on articles and invalidates related caches after mutations.",
  "frontend/src/hooks/admin/useAdminStatus.ts": "Checks whether the authenticated caller is an admin using the actor and Internet Identity state.",
  "frontend/src/hooks/admissions/useAdmissionRequests.ts": "Fetches all admission requests and provides a mutation to delete individual requests with cache invalidation.",
  "frontend/src/hooks/admissions/useSubmitAdmission.ts": "Provides a mutation for submitting new admission requests through the actor.",
  "frontend/src/hooks/articles/useArticleById.ts": "Fetches a single article by ID via the actor with disabled retries.",
  "frontend/src/hooks/articles/usePublishedArticles.ts": "Fetches all published articles using the actor with React Query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks to fetch and save the current user's profile using the backend actor.",
  "frontend/src/hooks/youtube/useYouTubeChannelFeed.ts": "Fetches and parses a YouTube channel's feed into video objects using react-query.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/Admin/AdminAdmissionsPage.tsx": "Admin page for listing and archiving admission requests with UI dialogs and actions.",
  "frontend/src/pages/Admin/AdminArticlesPage.tsx": "Admin interface for creating, editing, deleting, and publishing articles.",
  "frontend/src/pages/Admin/AdminDashboardPage.tsx": "Dashboard linking to admin article management and admission request pages.",
  "frontend/src/pages/Admissions/AdmissionsPage.tsx": "Renders an admissions form with validation and submission handling, showing a success screen after submission. Uses a mutation hook and UI components for inputs and layout.",
  "frontend/src/pages/Articles/ArticleDetailPage.tsx": "Fetches and displays a single article by ID with loading and error states. Provides navigation back to the articles list.",
  "frontend/src/pages/Articles/ArticlesListPage.tsx": "Loads and displays a grid of published articles with skeletons, error handling, and clickable cards. Allows navigation to individual article pages.",
  "frontend/src/pages/Contact/ContactPage.tsx": "Shows contact information with copy-to-clipboard actions and social links. Provides UI cards for WhatsApp, phone, email, and address.",
  "frontend/src/pages/CoursesExams/CoursesExamsPage.tsx": "Displays academic classes and competitive exam offerings with descriptions and subjects. Uses cards and sections to organize course information.",
  "frontend/src/pages/Home/HomePage.tsx": "Home page with hero section, navigation buttons, and feature cards highlighting offerings. Includes a hero image and calls to action for admissions and articles.",
  "frontend/src/pages/YouTube/YouTubePage.tsx": "React page showing a YouTube channel feed with loading, error, and video grid states, using a hook to fetch videos and buttons to open links.",
  "frontend/src/utils/assetPaths.ts": "Utility to generate base-path-aware asset URLs by cleaning paths and prefixing with the app's BASE_URL.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, retrieving persisted values, and handling hash-based routing cases.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, shadows, keyframes, and container settings with plugins enabled.",
  "project_state.json": "Project state file describing app purpose, requirements, issues, and version metadata for the Keep Going Classes website."
}