{
  "backend/main.mo": "Motoko canister managing user profiles, articles, and admission requests with permission checks for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind base and theme CSS defining light/dark OKLCH color tokens and global styles.",
  "frontend/index.html": "HTML entry point configuring metadata, manifest, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and display properties.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, admin protection, theming, and notifications.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper component that restricts access to admin-only pages based on authentication and admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with state handling and query cache reset on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to submit name and email, saving via profile mutation.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout component providing header, navigation, main content area, and footer with social links.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Responsive navigation bar showing routes and admin link when applicable, with mobile sheet menu handling.",
  "frontend/src/hooks/admin/useAdminArticleMutations.ts": "React Query hooks for fetching all articles and performing create, update, delete, and publish actions via actor.",
  "frontend/src/hooks/admin/useAdminStatus.ts": "Hook checking whether the current authenticated user is an admin using the actor API.",
  "frontend/src/hooks/admissions/useAdmissionRequests.ts": "Hooks to fetch all admission requests and delete individual requests through the actor.",
  "frontend/src/hooks/admissions/useSubmitAdmission.ts": "Mutation hook to submit a new admission request through the actor.",
  "frontend/src/hooks/articles/useArticleById.ts": "Fetches a single article by ID using the actor with controlled retry and enabled state.",
  "frontend/src/hooks/articles/usePublishedArticles.ts": "Fetches all published articles via the actor when available.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor instance tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity authentication, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Hooks to fetch and save the caller's user profile using the actor, with query invalidation on updates.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with warm color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin/AdminAdmissionsPage.tsx": "Displays and manages admission requests, allowing admins to archive submissions.",
  "frontend/src/pages/Admin/AdminArticlesPage.tsx": "Admin interface for creating, editing, publishing, and deleting articles with modal dialogs.",
  "frontend/src/pages/Admin/AdminDashboardPage.tsx": "Admin landing page linking to article management and admission request pages.",
  "frontend/src/pages/Admissions/AdmissionsPage.tsx": "Admission application form allowing users to submit personal info and program interest.",
  "frontend/src/pages/Articles/ArticleDetailPage.tsx": "Shows a single published article by ID with author info and loading/error states.",
  "frontend/src/pages/Articles/ArticlesListPage.tsx": "Lists all published articles with loading and error handling, linking to article detail pages.",
  "frontend/src/pages/Contact/ContactPage.tsx": "Renders a contact page with phone, email, address, social links, and clipboard copy functionality using cards and buttons.",
  "frontend/src/pages/Home/HomePage.tsx": "Implements the homepage with a hero section, feature cards, navigation actions, and a promotional image.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, typography, animations, and plugin usage for the project.",
  "project_state.json": "Defines the current project state, including features, requirements, metadata, and image needs."
}