{
  "kind": "build_request",
  "title": "Update Contact page with WhatsApp and phone numbers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Update the Contact page to display the user’s provided contact numbers: WhatsApp: 9889144312 and Phone: 9838784245.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add my contact details as \nWapp 9889144312\nAnd 9838784245"
        ]
      },
      "acceptanceCriteria": [
        "On /contact, the WhatsApp number 9889144312 is shown as a distinct contact method labeled in English as “WhatsApp”.",
        "On /contact, the phone number 9838784245 is shown as a distinct contact method labeled in English as “Phone”.",
        "Both numbers have a visible “Copy” action that copies the correct number to the clipboard and shows a success toast message in English.",
        "The phone number uses a working tel: link (clicking it opens the device dialer on supported devices/browsers).",
        "The WhatsApp number uses a working WhatsApp deep link (e.g., wa.me or https://api.whatsapp.com) that opens WhatsApp (or WhatsApp Web) on supported devices/browsers."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Remove/replace any placeholder contact phone number currently shown on the Contact page so only the provided numbers are presented as the primary phone/WhatsApp contacts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add my contact details as \nWapp 9889144312\nAnd 9838784245"
        ]
      },
      "acceptanceCriteria": [
        "The previously hardcoded placeholder phone number is no longer displayed as the main contact phone on /contact.",
        "No other placeholder contact numbers are presented as primary contact options on /contact."
      ]
    }
  ],
  "constraints": [
    "Frontend immutablePaths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding or changing backend storage for contact details (contacts can remain static in the frontend).",
    "Adding new authentication or login features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}