{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Contact page with WhatsApp and phone numbers",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Show WhatsApp and Phone contact methods on /contact with working deep links and copy-to-clipboard success toasts.",
      "acceptanceCriteria": [
        "On /contact, the WhatsApp number 9889144312 is shown as a distinct contact method labeled in English as “WhatsApp”.",
        "On /contact, the phone number 9838784245 is shown as a distinct contact method labeled in English as “Phone”.",
        "Both numbers have a visible “Copy” action that copies the correct number to the clipboard and shows a success toast message in English.",
        "The phone number uses a working tel: link (clicking it opens the device dialer on supported devices/browsers).",
        "The WhatsApp number uses a working WhatsApp deep link (e.g., wa.me or https://api.whatsapp.com) that opens WhatsApp (or WhatsApp Web) on supported devices/browsers."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact/ContactPage.tsx",
          "operation": "modify",
          "description": "Update the Contact page UI to include two distinct primary contact cards: “WhatsApp” (number 9889144312 with a working WhatsApp deep link such as wa.me/api.whatsapp.com) and “Phone” (number 9838784245 with a working tel: link). Add separate “Copy” actions for both numbers that copy the correct value and trigger an English success toast via the existing notification system. Use the existing shadcn-ui Card/Button components to keep styling consistent; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Remove any placeholder phone number from /contact so only the provided WhatsApp and Phone numbers are presented as primary contacts.",
      "acceptanceCriteria": [
        "The previously hardcoded placeholder phone number is no longer displayed as the main contact phone on /contact.",
        "No other placeholder contact numbers are presented as primary contact options on /contact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact/ContactPage.tsx",
          "operation": "modify",
          "description": "Replace the current placeholder phone value (e.g., “+91 98765 43210”) and any other placeholder primary contact numbers in the main contact section so the only primary phone/WhatsApp contacts shown are WhatsApp: 9889144312 and Phone: 9838784245. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}