{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 7 production promotion notes and post-deploy smoke checks (frontend)",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Add frontend-facing release notes/checklist and remove basepath-sensitive navigation issues to support promoting Version 7 to production.",
      "acceptanceCriteria": [
        "Version 7 is live and publicly accessible without deployment errors.",
        "The live deployment serves the latest frontend and backend canister code for Version 7."
      ],
      "file_operations": [
        {
          "path": "frontend/RELEASE_V7_PROMOTION.md",
          "operation": "create",
          "description": "Create a concise production promotion checklist for Version 7 focused on frontend readiness/verification (built assets, BASE_URL/basepath considerations, Internet Identity alternative origins file presence, and generated asset references)."
        },
        {
          "path": "frontend/src/pages/CoursesExams/CoursesExamsPage.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded anchor navigation to \"/admissions\" with router-based navigation (e.g., TanStack Router) so the link works correctly when hosted under a non-root basepath in production."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add a repeatable frontend smoke-test checklist and lightweight test hooks to validate public browsing, admissions submission confirmation, and Internet Identity/admin-route protection after deploy.",
      "acceptanceCriteria": [
        "Public pages load successfully: Home (/), Articles (/articles), Courses & Exams (/courses-exams), YouTube (/youtube), Contact (/contact).",
        "Submitting the Admissions form (/admissions) succeeds and shows the confirmation/success state.",
        "Internet Identity login works end-to-end and admin routes remain protected (e.g., /admin, /admin/articles, /admin/admissions)."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_V7.md",
          "operation": "create",
          "description": "Create a post-deploy smoke test checklist for the live environment covering: loading each required public route; validating admissions submission and confirmation state; verifying Internet Identity login/logout; and confirming admin routes are protected. Use the authorization component expectations (Internet Identity + role-based admin gating) as the basis for the checks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admissions/AdmissionsPage.tsx",
          "operation": "modify",
          "description": "Add stable, non-visual test hooks (e.g., data-testid attributes) for key admissions smoke-test elements: form container, submit button, and success/confirmation state, ensuring the live smoke test can reliably confirm the success state without changing UX."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Add stable, non-visual test hooks (e.g., data-testid) to support verifying Internet Identity login/logout in smoke tests. This aligns with the authorization component’s login/logout flow; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminGuard.tsx",
          "operation": "modify",
          "description": "Add stable, non-visual test hooks (e.g., data-testid) for the guard states (loading, login-required prompt, access-denied) to support validating admin-only access control in smoke tests. Use the authorization component’s RBAC expectations (admin-only) as reference; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}